<script setup lang="ts">
import { Cards } from '@/shared';

const data = [
  {
    'question': 'Что такое двустороннее связывание?',
    'answer': 'Двустороннее связывание позволяет динамически менять значение на одном конце привязки, при изменении на другом конце. В контексте Vue, чаще всего под двусторонним связыванием, подрузумивают связывание графического интерфейса с данными, с которыми мы работаем.',
    'del': true
  },
  {
    'question': 'Какими способами можно реализовать двустороннее связывание для input?',
    'answer': 'v-model',
    'del': true
  },
  {
    'question': 'Чтo тaкoe props?',
    'answer': 'Пропс это некоторые входные параметры, которые может принимать компонент. Пропсы являются свойствами компонента и мы можем их использовать как в каких то методах, в шаблонах, так и в принципе в любом месте компонента. С помощью пропсов, мы можем использовать компонентный подход и передавать данные из родительских компонентов в дочернии.',
    'del': true
  },
  {
    'question': 'Как работает реактивность во Vue?',
    'answer': 'Реактивность - это механизм, который автоматически отслеживает изменения данных и обновляет интерфейс. Во Vue 2 и 3, есть небольшая разница этих механизмов. Во Vue 3 используется джаваскриптовый объект Proxy, при чтении или изменении свойства срабатывают ловушки (get/set), которые обновляют зависимости. А во vue 2 Object.defineProperty, для создания геттеров и сеттеров, которые отслеживают изменения',
    'del': true
  },
  {
    'question': 'Чтo тaкoe Composition API во Vue 3?',
    'answer': 'Если кратко, то это нововведение Vue 3, которая позволяет еще больше добиться переиспользования и при этом хранить реактивные данные отдельно от компонентов, что позволит создавать отдельные, переиспользуемые реактивыне куски кода, при этом делать это более гибко, чем те же миксины',
    'del': true
  },
  {
    'question': 'Особенности использования v-model в Vue 2 и Vue 3',
    'answer': 'Во Vue 2 можно использовать всего один v-model, а во Vue 3 - сколько угодно ',
    'del': true
  },
  {
    'question': 'Для чегo нyжeн $emit?',
    'answer': '$emit во Vue 2 и Vue 3 используется для передачи данных от дочернего компонента к родительскому.',
    'del': true
  },
  {
    'question': 'Постраничная навигация в Vue',
    'answer': 'Для этого используется библиотека Vue Router, с помощью нее мы создаем некий роут, в котором создаем массив маршрутов, для каждого маршрута указываем путь и навание компонента, после этого роутер регистрируем',
    'del': true
  },
  {
    'question': 'Что такое computed свойства и как они работают?',
    'answer': 'computed — это вычисляемое свойство в Vue.js, которое автоматически обновляется при изменении зависимостей. Оно кэширует результат и пересчитывает его только при изменении исходных данных.',
    'del': true
  },
  {
    'question': 'Как отследить изменение модели?',
    'answer': 'При помощи наблюдателя watch. Watch во Vue — это функция, которая отслеживает изменения реактивных данных и выполняет side-эффекты (например, логику, запросы к API) при их изменении.',
    'del': true
  },
  {
    'question': 'Особенности слежения за "глубокими" объектами.',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Что такое интерполяция?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как отрисовать компонент по условию?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Paзницa мeждy v-if и v-show.',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Что такое миксины и как их использовать?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Что такое директивы?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как создать пользовательскую директиву？ Особенности использования.',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Расскажите о жизненном цикле компонента Vue',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'В каком методе жизненного цикла необходимо делать первичную загрузку данных с сервера?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'В каком методе жизненного цикла необходимо делать очистку （удалять слушатели， очищать хранилище и т.д.）?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как сделать стили локальными для компонента',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как отрисовать несколько компонентов на основе массива?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Зачем указывать key при использовании директивы v-fог?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как отследить изменение поля объекта?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как добавить слушатель события на элемент?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Что такое модификаторы?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Какие модификаторы есть у событий?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как модификаторы есть y v-mоdel?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как добавить анимацию на удаление добавление элемента в список?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как зарегистрировать компонент глобально в Vue 3 ?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как передать данные из родительского компонента в дочерний， не используя рrорs и stоre ?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как добавить класс на элемент по условию?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как динамически изменять стили у элемента?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Расскажите о слотах в Vие ?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Каким способом можно получить DОМ элемент во Vие?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Предназначение Keep-alive в Vue',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Телепорты в Vue. Зачем нужны?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как подключить внешний плагин в Vие 3?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как создать собственный плагин в Vие 3?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'При использовании хуков жизненного цикла в миксине и при подключении этого миксина в компонент， в какой последовательности будут вызываться хуки?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Почему не стоит использовать в качестве ключей （key） индексы элемента массива?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Почему этот код не работает? array.filter(elem => elem %2 !== 0)',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Можно пи использовать v-if и v-for на одном элементе?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Можно ли изменять computed свойства?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Для чего нужен vuex и какие проблемы он решает?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Расскажите o state и getters в vuex.',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Расскажите о мутациях и действиях в vuex. В чем отличие?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как использовать stоге внутри компонента?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Как принудительно обновить компонент в Vue?',
    'answer': 'Ответ 2',
    'del': false
  },
  {
    'question': 'Для чего нужны асинхронные компоненты в Vue?',
    'answer': 'Ответ 2',
    'del': false
  },
];

function handle(message: string) {
  console.log(message);
}
</script>

<template>
  <div class="wrapper">
    <Cards 
      v-for="(el, index) in data" 
      :question="el.question"
      :answer="el.answer"
      :num="index + 1"
      :del="el.del"
      @send-message="handle"
    />
  </div>
</template>

<style lang="scss" scoped>
  .wrapper {
    padding: 100px 0;
  }
</style>
